{
	"project": {
		"meta": {
			"refName": "frc2019",
			"title": "FRC 2019 Season",
			"version": "",
			"description": "FIRST Robotics 2019 Season with the 2702 Rebels",
			"github": "",
			"otherLink": ["https://2702rebels.com/", "the 2702 Rebels Website"]
		},
		"content": [
			{
				"heading": "Overview",
				"text": "Run by FIRST, the FIRST Robotics Competition is an environment designed for teams of high school students to advance their engineering skills and compete on a large international level."
			},
			{
				"text": "For the 2019 Season of Destination: Deep Space, I participated as a new member on the 2702 Rebels. The Rebels are a community-based team in the Kitchener Waterloo Region of Ontario Canada. Throughout the season, the team made it to the nationals in Detroit to compete on an international scale."
			},
			{
				"text": "An overview of the year’s game consisted of two alliances, with three teams on an alliance (one team being one robot) attempting to earn the most points. Some objectives the robots would perform were placing thirteen-inch rubber balls of “cargo” into “rocket ships”, patching the holes on the “rocket ships” with nineteen-inch discs known as “hatch panels”, and finally climbing a podium for extra points."
			},
			{
				"heading": "Design",
				"text": "To construct a fully functioning hundred-twenty-pound robot, one of the first steps is always to consider many designs for the mechanisms and robot as a whole. The first two weeks of the six weeks are purely dedicated to design and prototyping. Being a freshman student, I participated in the team-wide design choices. Past that, I assisted in the design of minor features on the Intake and Elevator."
			},
			{
				"text": "This year, the team’s robot consisted mainly of five key mechanisms, the Drive Train, the Intake, the Hatch Gripper, the Elevator, and the Shooter.",
				"image": "robo pic.png",
				"caption": "Render of the Full Robot"
			},
			{
				"text": [
					"Computer Assisted Design files are available thru contact at",
					{
						"link": "https://2702rebels.com/",
						"text": "the 2702 Rebels Website."
					}
				]
			},
			{
				"heading": "Drive Train",
				"text": "For this year, the robot needed fast and reliable movement. This was achieved by creating a six-wheel drive train. The six-inch rubber wheels were positioned level, except the middle two, which were slightly lower. This allowed for maneuvering. Lastly, the six wheels were driven by four CIM DC motors.",
				"image": "drive.png",
				"caption": "Render of the Drive Train"
			},
			{
				"heading": "Intake Mechanism",
				"text": "The purpose of the year’s intake was to be able to seize a cargo ball from the ground. There the ball will be held until needed to be shot, at which point the Shooter would come down and snatch the ball into its possession. Besides being used to gather cargo, the intake was used to hoist the robot onto the podium at the end of the game. This was done by coming out and pushing down with great torque, causing the robot to be hoisted upwards. As well, small rubber wheels were attached to the Intake to further help the robot roll onto the top of the podium.",
				"image": "intake.png",
				"caption": "Render of the Intake"
			},
			{
				"heading": "Hatch Gripper",
				"text": "The hatch gripper went thru a couple of major designs, and past that, many small adjustments. The general design was that the gripper would go thru the middle of the panel, and unfold, causing the disc to stay in place. The first design was bulky and required a great deal of lining up to work. With that, the next design was thinner and consisted of two sticks, which would then unfold like a pair of scissors. The hatch panel simply had to touch a limit switch and the pneumatic piston would cause the mechanism to activate.",
				"image": "hatcher.png",
				"caption": "Render of the Final Hatch Gripper"
			},
			{
				"heading": "The Elevator",
				"text": "The Elevator played a vital role in the ability of the robot. Mainly providing vertical positioning for the shooter, the Elevator also allowed the Hatch Gripper to be mounted on the other side and as well access different vertical positions. To reduce the power needed from the motors lifting the elevator, constant-tension springs were added on both sides of the elevator, each taking five kilograms off the elevator’s lifting weight.",
				"image": "elevated.png",
				"caption": "Render of the Elevator"
			},
			{
				"heading": "The Shooter",
				"text": "In the end, everything came down to the ability to gain points, and one of the primary ways to do that was to place the Cargo balls into the given Rockets and Cargo Bays. This was the function of the shooter. The design involved a simple gearbox that would spin an ABS pipe causing the ball to roll on the guiding panels and into the Cargo space the robot would be parked in front of.",
				"image": "shoot.png",
				"caption": "Render of the Shooter"
			},
			{
				"heading": "Manufacturing",
				"text": "When manufacturing the robot, not much time can be wasted. This is because only six weeks are given to start from scratch. On top of this, our team builds two robots, one known as the “practice bot” and the other used in tournaments."
			},
			{
				"text": "With that, the designers aim to create many parts to be 3D printed, as it allows for fast prototyping, easy assembly, and the ability to create extra parts if needed. Past that, parts need to be designed within the week so they can be given to our kind sponsors to be laser cut. The only component to ever be welded is the mainframe of the drive train. In the end, any parts that are left are man-made using the team workshop. General manufacturing being a less training-required task, many of these jobs are given to newer team members."
			},
			{
				"heading": "Software",
				"text": "The team uses many mandatory packages required by FIRST for robots to be tournament legal. Past that, robot code is written purely from scratch, with our team choosing to program in C++. The code is needed for anything from just moving, all the way to visually processing video and identifies light-reflective tape placed around the game for auto-coordination."
			},
			{
				"text": [
					"The code is available as-is at",
					{
						"link": "https://2702rebels.com/",
						"text": "the 2702 Rebels Website."
					}
				]
			},
			{
				"heading": "Business Team",
				"text": "On top of constructing a competitive robot, most teams run a business side to their team. Things like branding, website, sponsors, outreach and judge presentation are handled on the business team. This allows teams to present themselves in a community image attracting sponsors and more students for future recruiting. During tournaments, teams can also advance through winning different awards based on the team’s community activity. This presentation and speaking to the judges are created and done by those on the business team."
			},
			{
				"heading": "Scouting",
				"text": "To truly have a competitive edge, having a top-tier robot is not enough. To stay on top, many teams dedicate people to scouting matches. This involves having a person spectate one robot for a match and record the robot’s scoring, fouls, capabilities, condition, and performance. The tournaments being in an alliance manner, with three different robots on an alliance, the team must be aware of the opposing and ally robot’s capabilities and performance."
			},
			{
				"text": "Our team develops a mobile application for the Scouters to use during the long and tedious scouting sessions. The application is game-specific for the year and allows the Scouters to record points scored, how and when the points were scored, fouls, and make a comment regarding the team and robot. The application has to be fast and easy to use as the games are fast-paced and matches are a total of two minutes long. At the end of a match, the application would output a QR code with the encoded data of the robot for that match, then a Master Scouter would scan the following QR code and upload the data to our servers."
			},
			{
				"text": "After qualification matches end and the alliances begin to form, the Master Scouters get to work compiling the data. The Master Scouters go thru every team and every robot to compile a list of the best team our robot would be compatible with for a victory. Such strategizing sessions have gone up to eight hours long."
			},
			{
				"text": "On top of all the match scouting, the team performs pit scouting. This involves two people walking up to every team in the pits and asking them about their robot. The details collected are regarding the robot’s capabilities and design."
			},
			{
				"heading": "My Contributions",
				"text": "Starting as a freshman with very little experience, I aimed to help out where ever possible and grow in the fields of most interest to me. At the time, I thought my work to be irrelevant. Now having worked on more experience-reliant work, I think back, that although anyone could have done the jobs given to a freshman, the job had to be done and every small task amounted to a greater work put together."
			},
			{
				"text": "Regarding design, my lack of experience at the time stood in the way. That said when offered to design minor parts for the robot, I took the opportunities. Past that, I contributed to the prototyping of the main mechanisms."
			},
			{
				"text": "As for manufacturing, I played a vital role in increasing the team’s manufacturing rate. As a senior designer, it can be difficult to manage and assist with the production of parts. With that, I became a middle man. Given parts, I was aware of every student’s strong suits and was able to distribute the workload based on strengths well helping and teaching others how to operate machinery."
			},
			{
				"text": "During tournaments, my contributions can most be seen in scouting."
			},
			{
				"text": "All pit scouting was performed by me, often alone, starting from the regional competitions to the national. The task consisted of countless hours walking from team to team in the pit area, and afterwards entering the collected details manually into the database. This collected information allowed our team to understand another team’s robot and how well we can work with or against it."
			},
			{
				"text": "Past pit scouting, I pushed myself to become a Master Scouter. The responsibilities that came with that included organizing and supervising a group of six Scouters at a time well uploading their gathered scouting data to our servers. Before a competition, to ensure we have enough manpower, I would be responsible for creating timetables for the Scouters. As well, I would spectate all the matches and write very niche points that would prove beneficial to the team during strategy discussions. Lastly, I would attend scouting meetings and contribute to organizing the gathered data from a day’s work and arranging it in a visual and presentable manner."
			},
			{
				"text": "Behind the robot scene, I attended weekly business meetings. There I took interest in the team’s website. The website was outdated by over four years and I was able to deliver updated content as well as a better interface. In addition, I part took in almost every outreach event, creating a positive community image for the team. Furthermore, I slowly became fond of creating graphic designs for the team, this ranged from posters and business cards to banners."
			},
			{
				"text": "In the end, although my contributions could have been greater, they were substantial for a freshman and prepared me well for the next season."
			}
		]
	}
}
